docs/messages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-22 Wed 16:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ZIO messages</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">ZIO messages</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbf452ac">1. Schema</a>
<ul>
<li><a href="#orgbe773fd">1.1. Levels</a></li>
<li><a href="#orgbdee77d">1.2. Form</a></li>
<li><a href="#org4d90f53">1.3. Origin</a></li>
<li><a href="#orgcd35f24">1.4. Granule</a></li>
<li><a href="#org0d3929f">1.5. Seqno</a></li>
<li><a href="#orgac1ff49">1.6. Payload</a></li>
</ul>
</li>
<li><a href="#orgef61478">2. Single-part vs Multi-part</a>
<ul>
<li><a href="#org8ffcc96">2.1. ZeroMQ part-cardinality</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="nav">
<ul class="org-ul">
<li><a href="index.html">Main Page</a></li>
<li><a href="install.html">Installation</a></li>
<li><a href="tutorial.html">Tutorial</a></li>
<li><a href="howtos.html">How-to guides</a></li>
<li><a href="whytos.html">Design documents</a></li>
<li><a href="api.html">API Reference</a></li>
</ul>

</div>

<p>
ZIO messages are ultimately ZeroMQ messages but overlay a schema
convention for a portion of these messages.  On this convention, a
<a href="taxonomy.html">taxonomy</a> of ZIO behavior is built.
</p>

<div id="outline-container-orgbf452ac" class="outline-2">
<h2 id="orgbf452ac"><span class="section-number-2">1</span> Schema</h2>
<div class="outline-text-2" id="text-1">
<p>
A ZIO message is composed of several "segments" (avoiding "frame" and
"part" here, see <a href="#orgef61478">2</a> below).  The segments fall
into one of two categories which are called:
</p>

<dl class="org-dl">
<dt>header</dt><dd>leading data, follows a fixed schema determined by ZIO.</dd>
<dt>payload</dt><dd>trailing data in application-defined schema.</dd>
</dl>

<p>
A general message is illustrated in the following table where each
subtable represents one message segment.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-left">type</th>
<th scope="col" class="org-right">bytes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">magic</td>
<td class="org-left">"ZIO"</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">level</td>
<td class="org-left">"%d"</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">form</td>
<td class="org-left">(eg "JSON", "TEXT")</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">label</td>
<td class="org-left">free string</td>
<td class="org-right">N0</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">origin</td>
<td class="org-left">uint64</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">granule</td>
<td class="org-left">uint64</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">seqno</td>
<td class="org-left">uint64</td>
<td class="org-right">8</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">payload</td>
<td class="org-left">per form</td>
<td class="org-right">N1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">payload</td>
<td class="org-left">per form</td>
<td class="org-right">N2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>


<p>
The first two segments comprise the ZIO message header.  The first
header segment is called the <b>prefix header</b>.  The <b>prefix header</b>
contains these fields:
</p>

<dl class="org-dl">
<dt>magic</dt><dd>three ASCII characters: <code>ZIO</code> marks this as a ZIO message</dd>
<dt>level</dt><dd>a single digit, ASCII encoded gives the message level</dd>
<dt>form</dt><dd>a four byte form ID specifying the payload format, ZIO reserves a few.</dd>
<dt>label</dt><dd>optional, application dependent string</dd>
</dl>

<p>
Up to the <code>label</code> (but often including it as well) the prefix header can
be interpreted as an ASCII string and is suitable for use as a PUB/SUB
subscription prefix (thus the segment name).  Except for the
restrictions above, the prefix header contents may be freely provided.
</p>

<p>
The second header segment is called the <b>coordinate header</b> and has
three 64 bit unsigned integer fields with the following
interpretations:
</p>

<dl class="org-dl">
<dt>origin</dt><dd>identify the entity that produced the message.</dd>
<dt>granule</dt><dd>provide an ordering value for the message</dd>
<dt>seqno</dt><dd>index this message in a sequence of related messages.</dd>
</dl>

<p>
Additional details about these header quantities as well as
information on the payload segments follow.
</p>
</div>


<div id="outline-container-orgbe773fd" class="outline-3">
<h3 id="orgbe773fd"><span class="section-number-3">1.1</span> Levels</h3>
<div class="outline-text-3" id="text-1-1">
<p>
ZIO message have a <b>level</b> indicated by a single ASCII digit.  The
general interpretation is that of an importance level where a higher
value indicates greater importance and also less frequency.  ASCII
digits "0" through "8", inclusive, are allowed in ZIO messages.  No
other value for level is allowed in this version of ZIO.
</p>

<p>
The value "0" is explicitly reserved to me interpreted as <code>undefined</code>
and used in cases where no meaningful level exists.  The following
interpretations are recommended for the remaining levels and they are
provided in an enumeration defined in <code>libzio</code>.
</p>

<ol class="org-ol">
<li><code>trace</code>, messages are emitted from nested loops or occurring with
frequency far higher than any "events".</li>
<li><code>verbose</code>, messages will be emitted from contexts occurring more than
once per event.</li>
<li><code>debug</code>, potentially multiple messages of different types but each
type occurring once per event.</li>
<li><code>info</code>, a rare message, occurring no more than once event.</li>
<li><code>summary</code>, a message holding information about a collection of
events, emitted less than once per event.</li>
<li><code>warning</code>, a problem was encountered and handled.</li>
<li><code>error</code>, a problem was encountered, not handled (eg ignored) but the
emitting component continues to run.</li>
<li><code>fatal</code>, an error occurred and the component gives up (eg, component
throws/raises an exception or aborts shortly after).</li>
</ol>

<p>
Here an "event" is some driving impetus to the component emitting the
messages and which sets some time scale.  For example, a message
processing component might consider an "event" to be each input
message.  Or, it may be interpreted as each message which satisfies
some criteria.
</p>
</div>
</div>

<div id="outline-container-orgbdee77d" class="outline-3">
<h3 id="orgbdee77d"><span class="section-number-3">1.2</span> Form</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The <b>form</b> field provides a hint for the parsing of the payload, and
possibly its further interpretation.  That is, given the form,
application code consuming the payload should be able to read the
payload into memory in some suitable type of data structure and
possibly react to its content.
</p>

<p>
Except for the forms reserved by ZIO and described in <a href="format.html">format</a>, the
application developer is free to set the <b>form</b> field to any four byte
value.  It is suggested to try to make use of the reserved formats and
to not proliferate them due to conflating need for a new format hint
with need for schema hints.  The latter is discussed below in section
<a href="#orgac1ff49">1.6</a>.  If custom forms are used, it is further recommended to use
four ASCII characters to facilitate prefix matching. 
</p>
</div>
</div>

<div id="outline-container-org4d90f53" class="outline-3">
<h3 id="org4d90f53"><span class="section-number-3">1.3</span> Origin</h3>
<div class="outline-text-3" id="text-1-3">
<p>
In general, the interpretation of the value of the <b>origin</b> field is
application specific and a ZIO <a href="node.html">node</a> and its <a href="port.html">ports</a> have support for
managing it.  The recommended interpretation of <b>origin</b> is to identify
"where" a message came from.  
</p>
</div>
</div>


<div id="outline-container-orgcd35f24" class="outline-3">
<h3 id="orgcd35f24"><span class="section-number-3">1.4</span> Granule</h3>
<div class="outline-text-3" id="text-1-4">
<p>
In general, the interpretation of the value of the <b>granule</b> field is
application specific and ZIO provides support for interpreting
<b>granule</b> as the time at which the message was created, measured in
microseconds from the Unix Expoch.  The intent is for granule to
provide a means to synchronize related messages from different
origins.
</p>
</div>
</div>


<div id="outline-container-org0d3929f" class="outline-3">
<h3 id="org0d3929f"><span class="section-number-3">1.5</span> Seqno</h3>
<div class="outline-text-3" id="text-1-5">
<p>
In general, the interpretation of the value of the <b>seqno</b> field is
application specific.  The <b>seqno</b> value is intended to provide an
index into some logical sequence which spans messages in some set.
The set may be associated with all messages from a given port, a
given origin, or across some larger set of sources.  In a simple
case, it can count the messages from one port in order to detect
message loss (eg, if PUB/SUB is used).
</p>
</div>
</div>

<div id="outline-container-orgac1ff49" class="outline-3">
<h3 id="orgac1ff49"><span class="section-number-3">1.6</span> Payload</h3>
<div class="outline-text-3" id="text-1-6">
<p>
All segments that follow the header are called <i>payload</i>.  Ultimately,
the payload is fully in the domain of the application developer.  ZIO
does not dictate their use or format beyond the ZIO-reserved forms
and providing the <b>form</b> field in the ZIO header.
</p>

<p>
The header field <b>form</b> is intended to provide the hint needed to at
least <b>parse</b> the payload if not also to <b>interpret</b> it.  The field <b>label</b>
may be used to provide further hinting.
</p>

<p>
For example, it is expected that payload of a message with <b>form</b> set
to <code>JSON</code> can be parsed as a string in JSON format.  Interpreting the
resulting data structure may then rely on a variety of
application-dependent hints.  These include
</p>

<ul class="org-ul">
<li>Existence of some predefined attributes in the JSON object,</li>
<li>Auxiliary information from the message <b>label</b> or</li>
<li>Header information from the <a href="peer.html">peer</a> headers from the <a href="node.html">node</a> that sent the message.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgef61478" class="outline-2">
<h2 id="orgef61478"><span class="section-number-2">2</span> Single-part vs Multi-part</h2>
<div class="outline-text-2" id="text-2">
<p>
ZeroMQ exposes a concept of single-part vs multi-part messages.  This
section describes how ZIO deals with this dichotomy.
</p>
</div>

<div id="outline-container-org8ffcc96" class="outline-3">
<h3 id="org8ffcc96"><span class="section-number-3">2.1</span> ZeroMQ part-cardinality</h3>
<div class="outline-text-3" id="text-2-1">
<p>
In ZeroMQ, a "part" represents one atomic transfer of data between the
application and the ZeroMQ socket (or vice versa) in the process of
constructing a single message which will be transferred atomically
between ZeroMQ sockets.  
</p>

<p>
The different types of ZeroMQ sockets place different requirements on
this "part-cardinality" of the messages they process.  So called
"thread-safe" sockets<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> (CLIENT/SERVER, RADIO/DISH) require
single-part messages while others (REP/REQ/ROUTER/DEALER) require
multi-part and yet others (PAIR, PUB/SUB, PUSH/PULL) require neither
and can process either.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Here, "thread-safe" means the ability to use a socket from
different threads over its lifetime.  All ZeroMQ sockets can be used
from threads but "thread-unsafe" sockets must reside in the same
thread for their lifetime.  Some corner-cases may work but ZIO adheres
strictly to the recommendation by ZeroMQ documentation.
</p>

<p class="footpara">
When ZIO message are transferred via ZIO ports the socket type is
taken into account in order to assure proper part-cardinality.  A ZIO
message will be <i>encoded</i> into a single part prior to sending by sockets
that require single-part messages and will be <i>decoded</i> subsequent to
being received from a cohort.  All other sockets will see a ZIO
message in multiple parts.
</p></div></div>


</div>
</div></div>
</body>
</html>
